NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFM32PG23/EFM32PG23B310F128IM48.svd
        <register>
          <name>CH15_TIMING</name>
          <description>No Description</description>
          <addressOffset>0x1F0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>EXTIME</name>
              <description>Set excitation time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAMPLEDLY</name>
              <description>Set sample delay</description>
              <bitOffset>6</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEASUREDLY</name>
              <description>Set measure delay</description>
              <bitOffset>14</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH15_INTERACT</name>
          <description>No Description</description>
          <addressOffset>0x1F4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFF0FFF</resetMask>
          <fields>
            <field>
              <name>THRES</name>
              <description>ACMP threshold or DAC data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXMODE</name>
              <description>Set GPIO mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Push Pull, GPIO is driven high</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Push Pull, GPIO is driven low</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DACOUT</name>
                  <description>DAC output</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALTEX</name>
              <description>Use alternative excite pin</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAMPLECLK</name>
              <description>Select clock used for timing of sample d</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LFACLK</name>
                  <description>LFACLK will be used for timing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXHFRCO</name>
                  <description>AUXHFRCO will be used for timing</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXCLK</name>
              <description>Select clock used for excitation timing</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LFACLK</name>
                  <description>LFACLK will be used for timing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXHFRCO</name>
                  <description>AUXHFRCO will be used for timing</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETIF</name>
              <description>Enable interrupt generation</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No interrupt is generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL</name>
                  <description>Set interrupt flag if the sensor triggers.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POSEDGE</name>
                  <description>Set interrupt flag on positive edge of the sensor state</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEGEDGE</name>
                  <description>Set interrupt flag on negative edge of the sensor state</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTHEDGES</name>
                  <description>Set interrupt flag on both edges of the sensor state</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OFFSET</name>
              <description>OFFSET for IADC/ACMP interaction</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAMPLE</name>
              <description>Sample mode Selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACMPCOUNT</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC</name>
                  <description></description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCDIFF</name>
                  <description></description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CH15_EVALCFG</name>
          <description>No Description</description>
          <addressOffset>0x1F8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000037C</resetMask>
          <fields>
            <field>
              <name>DECODE</name>
              <description>Send result to decoder</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP</name>
              <description>Select mode for threshold comparison</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LESS</name>
                  <description>Comparison evaluates to 1 if sensor data is less than CTRTHRESHOLD, or if the ACMP output is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GE</name>
                  <description>Comparison evaluates to 1 if sensor data is greater than, or equal to CTRTHRESHOLD, or if the ACMP output is 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STRSAMPLE</name>
              <description>Enable storing of sensor sample in resul</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Nothing will be stored in the result buffer.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA</name>
                  <description>The sensor sample data will be stored in the result buffer.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATASRC</name>
                  <description>The data source, i.e. the channel, will be stored alongside the sensor sample data.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCANRESINV</name>
              <description>Enable inversion of result</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE</name>
              <description>Configure evaluation mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRES</name>
                  <description>Threshold comparison is used to evaluate sensor result</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLIDINGWIN</name>
                  <description>Sliding window is used to evaluate sensor result</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STEPDET</name>
                  <description>Step detection is used to evaluate sensor result</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CH15_EVALTHRES</name>
          <description>No Description</description>
          <addressOffset>0x1FC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>EVALTHRES</name>
              <description>Threshold </description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ST0_ARC</name>
          <description>No Description</description>
          <addressOffset>0x200</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x003FFFFF</resetMask>
          <fields>
            <field>
              <name>SCOMP</name>
              <description>Sensor compare value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMASK</name>
              <description>Sensor mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CURSTATE</name>
              <description>Current State </description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRSACT</name>
              <description>Configure transition action in normal mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No PRS output generated (if PRSCOUNT == 0), or do not count (if PRSCOUNT == 1).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS0</name>
                  <description>Pulse generated on LESENSE PRS output 0 (if PRSCOUNT == 0).</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UP</name>
                  <description>Count Up (if PRSCOUNT == 1).</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS1</name>
                  <description>Pulse generated on LESENSE PRS output 1 (if PRSCOUNT == 0).</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DOWN</name>
                  <description>Count Down (if PRSCOUNT == 1).</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS01</name>
                  <description>Pulse generated on LESENSE PRS output 0 and 1 (if PRSCOUNT == 0).</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS2</name>
                  <description>Pulse generated on LESENSE PRS output 2. (PRSCOUNT == 0 OR 1).</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS02</name>
                  <description>Pulse generated on LESENSE PRS output 0 and 2 (if PRSCOUNT == 0).</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPANDPRS2</name>
                  <description>Count Up and Pulse generated on LESENSE PRS output 2 (if PRSCOUNT == 1).</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS12</name>
                  <description>Pulse generated on LESENSE PRS output 1 and 2 (if PRSCOUNT == 0).</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DOWNANDPRS2</name>
                  <description>Count Down and Pulse generated on LESENSE PRS output 2 (if PRSCOUNT == 1).</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS012</name>
                  <description>Pulse generated on LESENSE PRS output 0, 1 and 2 (if PRSCOUNT == 0).</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NEXTSTATE</name>
              <description>Next state index</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SETIF</name>
              <description>Set interrupt flag</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ST1_ARC</name>
          <description>No Description</description>
          <addressOffset>0x204</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x003FFFFF</resetMask>
          <fields>
            <field>
              <name>SCOMP</name>
              <description>Sensor compare value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMASK</name>
              <description>Sensor mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CURSTATE</name>
              <description>Current State </description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRSACT</name>
              <description>Configure transition action in normal mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No PRS output generated (if PRSCOUNT == 0), or do not count (if PRSCOUNT == 1).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS0</name>
                  <description>Pulse generated on LESENSE PRS output 0 (if PRSCOUNT == 0).</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UP</name>
                  <description>Count Up (if PRSCOUNT == 1).</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS1</name>
                  <description>Pulse generated on LESENSE PRS output 1 (if PRSCOUNT == 0).</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DOWN</name>
                  <description>Count Down (if PRSCOUNT == 1).</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS01</name>
                  <description>Pulse generated on LESENSE PRS output 0 and 1 (if PRSCOUNT == 0).</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS2</name>
                  <description>Pulse generated on LESENSE PRS output 2. (PRSCOUNT == 0 OR 1).</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS02</name>
                  <description>Pulse generated on LESENSE PRS output 0 and 2 (if PRSCOUNT == 0).</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPANDPRS2</name>
                  <description>Count Up and Pulse generated on LESENSE PRS output 2 (if PRSCOUNT == 1).</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS12</name>
                  <description>Pulse generated on LESENSE PRS output 1 and 2 (if PRSCOUNT == 0).</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DOWNANDPRS2</name>
                  <description>Count Down and Pulse generated on LESENSE PRS output 2 (if PRSCOUNT == 1).</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS012</name>
                  <description>Pulse generated on LESENSE PRS output 0, 1 and 2 (if PRSCOUNT == 0).</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NEXTSTATE</name>
              <description>Next state index</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SETIF</name>
              <description>Set interrupt flag</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
